const singleChoice = `1. 学生可分阶段完成学业，但不能超过学校规定的最长学习年限（含休学）。最长学习年限为学制加（ ），时间自学生入学之日起计算。
A.一年     			B.两年     			C.三年    			D.半年
【答案】B
2. 新生和在校学生应征参加中国人民解放军（含中国人民武装警察部队），学校保留其入学资格或者学籍至退役后（ ）。
A.半年      			B.一年      			C.两年    			D.三年
【答案】C
3. 因病保留入学资格的，学生应持二级甲等及以上综合医院或专科医院诊断证明，经（ ）复检达到入学体检标准的，可按新生入学对待，重新办理入学手续。
A.校医院    			B.专科医院   		C.综合医院   		D.学校
【答案】A
4. 每学期开学，学生应按学校规定时间办理注册手续，确认学籍。未经注册的学生，不得（ ）。
A.入学    			B.参加学校一切教学活动   		C.上课     	D.参与奖学金评比
【答案】B
5. 学校给予学生处分，应当坚持（　）与违纪处分相结合，与学生违法、违纪行为的性质和过错的严重程度相适应；应当坚持公平、公正、公开；应当做到证据充分、依据明确、定性准确、程序正当、处分适当。
A.批评教育      		B.实际行动			C.程序正当   		D.合情合理
【答案】A
6. 学院在进行专业确认前，须制定详细完备的政策原则、工作流程，结合学校办学总体布局、专业实际办学条件及现有学生人数确定拟接收人数上限，专业确认方案报（ ）审核后公示。
A.教育局      		B.学校    			C.学院      			D.教务部
【答案】D
7. 计划从第N学期开始进入专业培养的学院，原则上在第N-1学期教学周第（ ）周完成学生的专业分流工作，并将分流后各专业的学生名单报教务部，同时公示。
A.7、8        		B.8、9    			C.6、7     			D.9
【答案】B
8. 学生思想品德的考核、鉴定，以《北京理工大学本科生管理规定》第四条为主要依据，采取个人小结、（  ）等形式进行。
A.学生评议 			B.班主任评议    		C.老师评议  			D.师生民主评议
【答案】D
9. 学生根据学校有关规定，可以申请修读学校开设的辅修或者双学位专业，也可以选修其他专业课程；可以申请跨校辅修专业或者修读课程，参加学校认可的开放式网络课程学习。学生修读的课程成绩（学分），经相关(  )认定，学校审核同意后，予以承认。
A.学院/书院 		B.任课老师 			C.教务部  			D.以上都不是
【答案】A
10. 因辅修课程与主修课程上课时间冲突等原因，学生须在课程开始后三周内提出免听申请，经学生所在学院批准，经任课教师同意，（ ）批准后方可免听该课程。
A.所在学院  			B.任课老师   		C.开课学院   		D.学校
【答案】C
11. 学生重新参加入学考试、符合录取条件，再次入学的，学校承认在有效期内其已获得的（ ）。
A.学分      			B.成绩        		C.绩点     			D.课程
【答案】A
12. 考核方式分为考试与考查。以（ ）方式考核的课程原则上要通过考试并结合过程考核综合评定成绩。
A.考试      			B.考查        		C.考核        		D.以上都是
【答案】A
13. 学校的教学、科研、后勤、管理等部门，应积极支持学生的（ ），并为学生创造条件，提供机会。
A.奖学金     		B.勤工助学      		C.奖助学金   			D.国家助学贷款
【答案】B
14. 本年度获得（  ）及各类助学金的学生自动编入学生服务大队，并自获得资助后起必须坚持参加公益性的社会活动或劳动。
A.徐特立奖学金  	B.社会捐助类奖学金	C.国家奖学金			D.励志类奖学金
【答案】D
15. 学生从事勤工助学活动，应在节假日和课余时间进行，原则上每周最长工作时间为20小时，每个岗位勤工助学酬金最高不超过（ ）元/月。
A.600       			B.800       			C.1000    			D.1200
【答案】B
16. 学生每学期免听课程总数不得超过（ ）门。
A.2         			B.3           		C.4 			D.5
【答案】B
17. 思想政治理论课、军事理论课及实习实践类课程不得申请（ ）。
A.补考     			B.重修         		C.免听        		D.重考
【答案】C
18. 学生参加创新创业、社会实践等活动以及发表论文、获得专利授权等与专业学习、学业要求相关的经历、成果，可以折算为（ ），计入学业成绩。
A.绩点     			B.学分        		C.学分绩点   		D.分数
【答案】B
19. 学生成绩单分为“档案成绩单”和“学业成绩单”,其中档案成绩单为学生课程全部成绩记录，存入学校档案馆；学业成绩单为学生每门课程最高成绩记录，存入（ ）。
A.学生档案 			B.学校档案馆  		C.学校       		D.学籍
【答案】A
20. 学生必须严格遵守考核纪律，不得旷考、作弊。凡擅自缺考（即旷考）的，该课程成绩按（ ）记。
A.无效      			B.“0”分      		C.不合格        		D.合格
【答案】B
21. 一个学期未取得学分数达到本学期要求学分数的1/3及以上，学校给予（ ）。
A.警告      			B.记过        		C.严重警告     		D.学业警示
【答案】D
22. 有（ ）需求的学生，须首先向所在学院/书院提交书面申请和个人提前修读计划书，所在学院/书院审核其提前修读计划可行性，由学院/书院教学工作负责人批准，教务部审核通过后，学生方可按照制定的个人提前修读计划书提前修读相关课程。
A.跳级       		B.留级           	C.降级     			D.休学
【答案】A
23. 各学院/书院受理跳级申请时间为（ ）。降级工作办理时间为每学期初。
A.每学期初   		B.每年秋季学期初	C.每年春季学期初   	D.任何时间
【答案】B
24. 学院/书院教学工作负责人是学生学业警示工作的第一负责人，（ ）应共同参与学业警示的实施工作。
A.学院教学工作负责人	B.学校教学工作负责人	C.学生工作负责人 	D.学生
【答案】C
25. 学业警示达到红色预警的，根据学生学业情况及教学安排，学院/书院提出学生（ ）处理意见，报教务部。
A.记过     			B.留级      			C.降级    			D.警告
【答案】C
26. 未通过课程学分累计达（ ）（不含）学分为红色预警。
A.10-30     			B.15-30      		C.10-20    			D.20-30
【答案】D
27. 各学院在确定专业确认或转专业的终审名单时要考虑到班级人数，原则上不超过（ ）人/班（外语类不超过 30人/班）。
A.26     			B.35    				C.40   				D.36
【答案】B
28. 因健康、创业等原因需暂停学业，学生可申请休学。休学时间原则上以一学年为单位。休学时间计入最长学习年限，累计不得超过二年，休学次数最多为（ ）次。
A.1       			B.2       			C.3     				D.4
【答案】B
29. 因心理问题已经发生伤害自身或他人安全的行为，或者有伤害自身或他人安全的危险，且拒绝就医的 ，学校应予（ ）。
A.退学       		B.休学       		C.请假     			D.警告
【答案】B
30. 下列哪种情形不可以转学（ ）。
A.入学满一学期                     		B.以非定向就业招生录取的			
C.由低学历层次转为高学历层次的     		D.有正当转学理由的
【答案】C
31. 学生必须在收到休学通知书（ ）个工作日内办理手续离校。
A.3       			B.4       			C.5     				D.6
【答案】C
32. 休学期满的学生，应于学期开学初（ ）周内向所在学院/书院申请复学，经相关部门复查合格，方可复学。
A.一      			B.二      			C.三     			D.四
【答案】A
33. 取消学籍、（ ）的学生不得申请复学。
A.休学    			B.退学     			C.跳级     			D.降级
【答案】B
34. 复查中发现学生身心状况不适宜在校学习的，学校指定的二级甲等及以上综合医院或专科医院诊断，需要在家休养的，可以按照第六条的规定（ ）。
A.休学    			B.退学     			C.保留入学资格    	D.留级
【答案】C
35. 在校生应征参加（ ）（含中国人民武装警察部队）的，保留学籍时间不计入最长学习年限。
A.陆军    			B.海军     			C.空军				D.中国人民解放军
【答案】D
36. 休学、保留学籍期满逾期两周未提出复学申请或申请复学经复查不合格的，应接受（ ）处理。
A.休学    			B.记过     			C.退学				D.警告
【答案】C
37. 对学生做出（ ）处理，应当由学生所在学院/书院填写退学处理申报表并附相关材料，教务部审核后报校长办公会或者专题会议研究决定。
A.警告    			B.记过     			C.退学				D.开除学籍
【答案】C
38. 学满一学年及以上时间退学的学生，学校发给（ ）。学习不满一学年的、开除学籍的，学校发给写实性学习证明。
A.毕业证书   		B.学位证书     		C.肄业证书   		D.荣誉证书
【答案】C
39. 在最长学习年限内，允许学生结业后通过旁听或直接参加学校课程考试等方式完成学业，达到毕业要求的，可换发毕业证书，符合学位授予条件的，可获得（ ）
A.毕业证书   		B.学位证书     		C.肄业证书 			D.结业证书
【答案】B
40. 学生在学校规定的学习年限内，修完教育教学计划规定内容，但未达到学校毕业要求的，准予结业，学校向其颁发（ ）。
A.毕业证书   		B.学位证书     		C.肄业证书			D.结业证书
【答案】D
41. （ ）严格按照招生时确定的办学类型和学习形式，以及学生招生录取时填报的个人信息，填写、颁发学历证书、学位证书及其他学业证书。
A.学校       		B.学院          		C.书院   			D.教务办
【答案】A
42. 学校执行高等教育学籍学历（ ）管理制度，完善学籍学历信息管理办法，按相关规定及时完成学生学籍学历注册。
A.档案       		B.电子注册        	C.学籍   			D.户口
【答案】B
43. 对以作弊、剽窃、抄袭等学术不端行为或者其他不正当手段获得学历证书、学位证书的，学校依法予以（ ）。
A.撤销      			B.作废        		C.处分   			D.注销
【答案】A
44. 被撤销的学历证书、学位证书已注册的，学校予以（ ）并报教育行政部门宣布无效。
A.撤销      			B.作废        		C.处分   			D.注销
【答案】D
45. 毕业、结业、肄业证书和学位证书遗失或损坏，经本人申请，（ ）核实后出具相应的证明书。
A.班主任      		B.学院/书院      	C.教务部     		D.学校
【答案】D
46. 新生入学报到时，学校对新生的入学资格进行初步审查，审查合格的办理入学手续，予以（ ）
A.入学      			B.注册学籍    		C.录取    			D.以上都不是
【答案】B
47. 审查发现新生的录取通知、考生信息等证明材料，与本人实际情况不符，或者有其他违反国家招生考试规定情形的，（　）。
A.严重警告      		B.记过  				C.留校察看    		D.取消入学资格
【答案】D
48. 学生入学后，学校在（　）内按照国家招生规定对其进行复查。
A.一个月      		B.两个月				C.三个月   			D.四个月
【答案】C
49. （　）可在最长学习年限内申请回校以旁听方式学习其未修或未及格的课程（含实验、实践环节），并参加考试，也可以直接申请参加相应考试。逾期不再受理申请。
A.结业生      		B.毕业生				C.应届生   			D.本科生
【答案】A
`;
